Repository: Backgammonian/Image-Sharing
Catalog: MyWebApp/Resources/SharedResource.*.resx
Languages: ru_ru

source: Admin panel
ru_ru: Админ панель

# AdminPanel_CreateThread
source: Create a new thread
ru_ru: Создать новую тему

# AdminPanel_DeleteThread
source: Select the thread to delete
ru_ru: Выберите тему для удаления

# AdminPanel_HelloAdmin
source: Hello, admin
ru_ru: Привет, админ

# AdminPanel_NoPermission
source: You have no permission to access this page.
ru_ru: У вас нет прав для доступа к этой странице.

# AdminPanel_Title
source: Administrative panel
ru_ru: Административная панель

# AlreadyLoggedIn
source: You are already logged in!
ru_ru: Вы уже выполнили вход!

source: Cancel
ru_ru: Отменить

# CantLoginIntoCreatedAccount
source: Can't log in into created account! Try to log in by yourself.
ru_ru: Не удалось войти в созданный аккаунт! Попробуйте войти самостоятельно.

# ChangeLanguage
source: Change the language
ru_ru: Поменять язык

# CreateNote_Description
source: Description
ru_ru: Описание

# CreateNote_DescriptionPlaceholder
source: New note description
ru_ru: Описание новой записи

# CreateNote_Images
source: Images
ru_ru: Изображения

# CreateNote_ImagesPlaceholder
source: Select image(s) for a new note
ru_ru: Выберите изображения для новой записи

# CreateNote_NoPermission
source: You are not logged in!
ru_ru: Вы не вошли в систему!

# CreateNote_PageTitle
source: Create a new note
ru_ru: Создать новую запись

# CreateNote_Submit
source: Submit
ru_ru: Создать

# CreateNote_Thread
source: Thread
ru_ru: Тема

# CreateNote_ThreadSelection
source: Select a thread
ru_ru: Выберите тему

# CreateNote_Title
source: Title
ru_ru: Заголовок

# CreateNote_TitlePlaceholder
source: New note title
ru_ru: Заголовок новой записи

# CreateThread_CantCreate
source: Can't create a new thread.
ru_ru: Не удалось создать новую тему.

# CreateThread_EnterNameForThread
source: Enter the name of a new thread
ru_ru: Введите имя новой темы

# CreateThread_ExistingThreadNames
source: Existing thread names
ru_ru: Существующие темы

# CreateThread_NewThreadName
source: New thread name (will be converted to lower case)
ru_ru: Название новой темы (будет переведо в строчные буквы)

# CreateThread_NewThreadNamePlaceholder
source: New thread name
ru_ru: Название новой темы

# CreateThread_NoPermission
source: You have no permission to create a new thread!
ru_ru: У вас нет прав создавать новые темы!

# CreateThread_Submit
source: Submit
ru_ru: Создать

# CreateThread_ThreadAlreadyExists
source: Thread with such name already exists! (or something else went wrong)
ru_ru: Тема с таким именем уже существует! (или что-то другое пошло не так)

# CreateThread_Title
source: Create a thread
ru_ru: Создать новую тему

source: Dashboard
ru_ru: Профиль

# Dashboard_NoNotes
source: You don't have any notes.
ru_ru: У вас нет ни одной записи.

# Dashboard_NotFound
source: This dashboard doesn't exist.
ru_ru: Этот профиль не существует.

# Dashboard_Title
source: Dashboard
ru_ru: Профиль

source: Delete
ru_ru: Удалить

# DeleteNote_AreYouSure
source: Are you sure you want to delete this note?
ru_ru: Вы уверены, что хотите удалить эту запись?

# DeleteNote_Author
source: Author
ru_ru: Автор

# DeleteNote_DeleteButton
source: Delete
ru_ru: Удалить

# DeleteNote_NoDeletePermission
source: You have no permission to delete this note.
ru_ru: У вас нет прав для удаления этой записи.

# DeleteNote_NoPermission
source: You are not logged in!
ru_ru: Вы не выполнили вход!

# DeleteNote_NoteDescription
source: Description
ru_ru: Описание

# DeleteNote_NoteTitle
source: Title
ru_ru: Заголовок

# DeleteNote_Nothing
source: There is nothing to delete.
ru_ru: Здесь нечего удалять.

# DeleteNote_Submit
source: Delete the note
ru_ru: Удаление записи

# DeleteNote_Thread
source: Thread
ru_ru: Тема

# DeleteNote_Title
source: Delete the note
ru_ru: Удалить запись

# DeleteNote_UnknownAuthor
source: Unknown author
ru_ru: Неизвестный автор

# DeleteThread_CantDelete
source: Can't delete the thread
ru_ru: Невозможно удалить тему

# DeleteThread_FirstSelectionElement
source: Select a thread to delete
ru_ru: Выберите тему для удаления

# DeleteThread_NoPermission
source: You have no permission to delete any threads!
ru_ru: У вас нет прав для удаления тем!

# DeleteThread_Select
source: Select the thread you want to delete
ru_ru: Выберите тему, которую нужно удалить

# DeleteThread_Submit
source: Submit
ru_ru: Подтвердить

# DeleteThread_Subtitle
source: Thread
ru_ru: Тема

# DeleteThread_Title
source: Delete the thread
ru_ru: Удалить тему

source: Details
ru_ru: Подробности

source: Edit
ru_ru: Редактировать

# EditNote_Description
source: Description
ru_ru: Описание

# EditNote_DescriptionPlaceholder
source: Description of the note
ru_ru: Описание записи

# EditNote_ImageReminder
source: Don't select new images if you want to keep the old ones.
ru_ru: Не выбирайте новые изображения, если хотите сохранить старые.

# EditNote_Images
source: Images
ru_ru: Изображения

# EditNote_ImagesPlaceholder
source: Note images
ru_ru: Прикреплённые изображения

# EditNote_NoEditPermission
source: You have no permission to edit this note.
ru_ru: У вас нет прав для редактирования этой записи.

# EditNote_NoPermission
source: You are not logged in!
ru_ru: У вас не выполнен вход!

# EditNote_NoteTitle
source: Title
ru_ru: Заголовок

# EditNote_NoteTitlePlaceholder
source: Title of the note
ru_ru: Заголовок записи

# EditNote_SelectedThread
source: Selected thread
ru_ru: Выбранная тема

# EditNote_Submit
source: Submit
ru_ru: Подтвердить

# EditNote_ThreadSelection
source: Select a thread
ru_ru: Выбрать тему

# EditNote_Title
source: Edit the note
ru_ru: Редактировать запись

# EditNote_WrongInput
source: Failed to edit the note: invalid input.
ru_ru: Не удалось редактировать запись: недопустимые входные данные.

# EditProfile
source: Edit the profile
ru_ru: Редактировать профиль

# EditUserProfile_NoEditPermission
source: You have no permission to edit your profile.
ru_ru: У вас нет прав для редактирования этого профиля.

# EditUserProfile_NoPermission
source: You are not logged in!
ru_ru: Вы не выполнили вход!

# EditUserProfile_PictureReminder
source: Don't select a new profile image if you want to keep the old one.
ru_ru: Не выбирайте новое изображение профиля, если хотите сохранить старое.

# EditUserProfile_ProfilePicturePlaceholder
source: Select new profile picture
ru_ru: Выбрать новое изображение профиля

# EditUserProfile_ProfilePictureTitle
source: New profile picture
ru_ru: Новое изображение профиля

# EditUserProfile_StatusPlaceholder
source: Your status
ru_ru: Ваш статус

# EditUserProfile_StatusTitle
source: Status
ru_ru: Статус

# EditUserProfile_Submit
source: Submit
ru_ru: Подтвердить

# EditUserProfile_Title
source: Edit the profile
ru_ru: Редактировать профиль

# EditUserProfile_WrongInput
source: Failed to edit the profile: invalid input.
ru_ru: Не удалось отредактировать профиль: недействительные введённые данные.

# EmailAlreadyInUse
source: This e-mail address is already in use
ru_ru: Этот адрес электронной почты уже используется

# Error404_Text1
source: 404 - Page not found
ru_ru: 404 - Не найдено

# Error404_Text2
source: Sorry, requested item doesn't exist.
ru_ru: Извините, запрашиваемый элемент не найден.

# Error404_Title
source: Not found
ru_ru: Не найдено

# Error500_Text1
source: 500 - We have a problem
ru_ru: 500 - Внутренняя ошибка

# Error500_Text2
source: Sorry, an internal error occurred while executing your request.
ru_ru: Извините, произошла внутренняя ошибка при обработке запроса.

# Error500_Title
source: Internal error
ru_ru: Внутренняя ошибка

# ErrorPage_Text
source: An error occurred while processing your request.
ru_ru: Произошла ошибка при обработке вашего запроса.

# ErrorPage_Title
source: Error
ru_ru: Ошибка

# ErrorWrongPage_Text1
source: 404 - Page not found
ru_ru: 404 - Страница не найдена

# ErrorWrongPage_Text2
source: Error: can't get
ru_ru: Ошибка: не удалось получить

# ErrorWrongPage_Text3
source: notes from page
ru_ru: записей из страницы

# ErrorWrongPage_Title
source: Wrong page error
ru_ru: Недействительная страница

# GetByThread_NotesFromThread
source: Notes from thread
ru_ru: Записи по теме

# GetByThread_Nothing
source: There aren't any notes.
ru_ru: Здесь еще нет записей.

# GetByThread_Title
source: Thread
ru_ru: Тема

source: Home
ru_ru: Главная страница

# Home_Begin1
source: Let's see the
ru_ru: Давайте посмотрим на

# Home_Begin2
source: Creations
ru_ru: Творения

# Home_Begin3
source: of other people!
ru_ru: других людей!

# Home_CreateAccount
source: Create account
ru_ru: Создать аккаунт

# Home_CreateNewNote
source: Create a new note
ru_ru: Создать новую запись

# Home_Or
source: or
ru_ru: или

# Home_SignIn
source: Sign in
ru_ru: Войти

# Home_SignIn_cont
source: to create a new note.
ru_ru: перед созданием новой записи

# Home_Subtitle
source: Simple sharing platform and web storage for images.
ru_ru: Простая веб-платформа для обмена и хранения изображениями.

# Home_Subtitle_cont
source: Built using
ru_ru: Построено с использованием

# Home_Title
source: Main page
ru_ru: Главная страница

# Home_YouCanAlso
source: You can also
ru_ru: Вы также можете

# InputIsNotValid
source: The input is not valid
ru_ru: Входные данные недействительны

source: Log in
ru_ru: Войти

# Login_Email
source: E-mail
ru_ru: Электронная почта

# Login_EmailPlaceholder
source: Enter your e-mail address
ru_ru: Адрес электронной почты

# Login_Password
source: Password
ru_ru: Пароль

# Login_PasswordPlaceholder
source: Enter your password
ru_ru: Введите пароль

# Login_Submit
source: Log in
ru_ru: Войти

# Login_Title
source: Log in
ru_ru: Вход в систему

source: Log out
ru_ru: Выйти из системы

# LogoutBeforehand
source: If you want to register a new account please sign out first.
ru_ru: Если вы хотите создать новый аккаунт, пожалуйста, сперва выйдите из своего.

# NoteCreate_NotLoggedIn
source: Log in first in order to create a new note!
ru_ru: Войдите в систему перед созданием новой записи!

# NoteCreate_WrongInput
source: Failed to create a new note: invalid input.
ru_ru: Не удалось создать новую запись: недействительные входные данные.

# NoteDetails_DoesntExist
source: This note doesn't exist.
ru_ru: Такой записи не существует.

# NoteDetails_PageTitle
source: Note details
ru_ru: Подробности записи

# NoteDetails_PageTitleMinified
source: Note details
ru_ru: Подробности записи

source: Notes
ru_ru: Записи

# NotesList_Notes
source: Notes
ru_ru: Список записей

# NotesList_Nothing
source: There are no notes yet.
ru_ru: Здесь нет ни одной записи. Пока что.

# NotesList_Title
source: Notes
ru_ru: Список записей

# PaginationResults
source: Results
ru_ru: Результаты

# PaginationResults_Next
source: Next
ru_ru: След.

# PaginationResults_of
source: of
ru_ru: из

# PaginationResults_Prev
source: Prev
ru_ru: Пред.

source: Privacy
ru_ru: Политика конфиденциальности

# Privacy_Text
source: All of your data and images are belong to us. Sus ඞ
ru_ru: Все ваши данные и изображения принадлежат нам. Sus ඞ

# Privacy_Title
source: Privacy policy
ru_ru: Политика конфиденциальности

source: Register
ru_ru: Зарегистрироваться

# Register_ConfirmPassword
source: Confirm the password
ru_ru: Подтвердите пароль

# Register_ConfirmPasswordPlaceholder
source: Enter the password again
ru_ru: Повторите введённый пароль

# Register_Email
source: E-mail
ru_ru: Электронная почта

# Register_EmailPlaceholder
source: Enter e-mail address for a new account
ru_ru: Адрес электронной почты

# Register_Password
source: Password must be at least 8 characters long!
ru_ru: 8 символов - минимальная длина пароля!

# Register_PasswordPlaceholder
source: Enter a safe password for a new account
ru_ru: Пароль для нового аккаунта

# Register_Submit
source: Sign up
ru_ru: Зарегистрироваться

# Register_Title
source: Sign up
ru_ru: Регистрация

source: Registration failed
ru_ru: Регистрация не удалась

# SelectLanguage
source: Select the language
ru_ru: Выберите язык

# SignUpForNewAccount
source: Sign up for a new account
ru_ru: Создайте новый аккаунт

source: Sing in to your account
ru_ru: Войдите в свой аккаунт

source: Sorry! Error occured
ru_ru: Извините! Произошла ошибка

source: Thread
ru_ru: Тема

source: Threads
ru_ru: Темы

# Threads_Nothing
source: There are no threads yet.
ru_ru: Здесь нет тем. Пока что.

# Threads_Title
source: All threads
ru_ru: Все темы

# UserDetails_NotesButton
source: View the notes of
ru_ru: Смотреть записи

# UserDetails_Nothing
source: This user doesn't exist.
ru_ru: Этого пользователя не существует.

# UserDetails_ProfileOf
source: Profile of
ru_ru: Профиль

# UserDetails_Title
source: User's profile
ru_ru: Профиль пользователя

# UserNotes_NotesOfUser
source: Notes of user
ru_ru: Записи пользователя

# UserNotes_Nothing
source: This user does't exist.
ru_ru: Этого пользователя не существует.

# UserNotes_Title
source: User's notes
ru_ru: Записи пользователя

# WrongCredentials
source: Wrong credentials, please try again
ru_ru: У вас нет полномочий, пожалуйста, попробуйте в другой раз

source: Your dashboard
ru_ru: Ваш профиль
